docs/MODELE_BDD.md
```mermaid
erDiagram
    UTILISATEUR ||--o{ MOVIE : "crée/importe"
    MOVIE ||--o{ MOVIE_ACTOR : "associe"
    MOVIE ||--o{ MOVIE_GENRE : "classé"
    ACTOR ||--o{ MOVIE_ACTOR : "participe"
    GENRE ||--o{ MOVIE_GENRE : "lié"

    UTILISATEUR {
        int id PK
        string username
        string email
        string password
        string role
    }

    MOVIE {
        int id PK
        int tmdb_id
        string title
        text description
        date release_date
        string director
        int runtime
        string poster_path
        string backdrop_path
        float vote_average
        int vote_count
        int id_utilisateur FK
    }

    ACTOR {
        int id PK
        int tmdb_id
        string name
        string original_name
        int gender
        text biography
        date birthday
        date deathday
        string place_of_birth
        string profile_path
        float popularity
        string known_for_department
        string imdb_id
    }

    GENRE {
        int id PK
        string name
    }

    MOVIE_ACTOR {
        int id_movie FK
        int id_actor FK
        string character_name
        int order_index
        string credit_id
    }

    MOVIE_GENRE {
        int id_movie FK
        int id_genre FK
    }
```
